app/Models/ModelMonitoring.php

SELECT *
FROM `tbl_presensi`
LEFT JOIN `tbl_karyawan` ON `tbl_karyawan`.`id_karyawan`=`tbl_presensi`.`id_karyawan`
LEFT JOIN `tbl_jabatan` ON `tbl_jabatan`.`id_jabatan`=`tbl_karyawan`.`id_jabatan`
ORDER BY `tbl_presensi`.`id_presensi` DESC
---
    public function allData()
    {

        return $this->db->table('tbl_presensi')
            ->join('tbl_karyawan', 'tbl_karyawan.id_karyawan=tbl_presensi.id_karyawan', 'LEFT')
            ->join('tbl_jabatan', 'tbl_jabatan.id_jabatan=tbl_karyawan.id_jabatan', 'LEFT')

            ->orderBy('tbl_presensi.id_presensi', 'DESC')
            ->get()->getResultArray();