app/Models/ModelHome.php

    public function dataKaryawan()
    {
        return $this->db->table('tbl_karyawan')->join('tbl_jabatan', 'tbl_jabatan.id_jabatan=tbl_karyawan.id_karyawan', 'LEFT')->where('id_karyawan', session()->get('id_karyawan'))->get()->getRowArray();
---
SELECT *
FROM `tbl_karyawan`
LEFT JOIN `tbl_jabatan` ON `tbl_jabatan`.`id_jabatan`=`tbl_karyawan`.`id_karyawan`
WHERE `id_karyawan` = '1'

    public function cekPresensi()
    {
        return $this->db->table('tbl_presensi')
            ->where('id_karyawan', session()->get('id_karyawan'))
            ->where('tgl_presensi', date('Y-m-d'))
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_presensi`
WHERE `id_karyawan` = '1'
AND `tgl_presensi` = '2023-11-14'

    public function presensiPerbulan()
    {
        return $this->db->table('tbl_presensi')
            ->where('id_karyawan', session()->get('id_karyawan'))
            ->where('MONTH(tgl_presensi)', date('m'))
            ->where('year(tgl_presensi)', date('Y'))
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_presensi`
WHERE `id_karyawan` = '1'
AND MONTH(tgl_presensi) = '11'
AND year(tgl_presensi) = '2023'

    public function Leaderboard()
    {
        return $this->db->table('tbl_presensi')
            ->join('tbl_karyawan', 'tbl_karyawan.id_karyawan=tbl_presensi.id_karyawan', 'LEFT')
            ->join('tbl_jabatan', 'tbl_jabatan.id_jabatan=tbl_karyawan.id_jabatan', 'LEFT')
            ->where('tbl_presensi.tgl_presensi', date('Y-m-d'))
            ->orderBy('tbl_presensi.id_presensi', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_presensi`
LEFT JOIN `tbl_karyawan` ON `tbl_karyawan`.`id_karyawan`=`tbl_presensi`.`id_karyawan`
LEFT JOIN `tbl_jabatan` ON `tbl_jabatan`.`id_jabatan`=`tbl_karyawan`.`id_jabatan`
WHERE `tbl_presensi`.`tgl_presensi` = '2023-11-14'
ORDER BY `tbl_presensi`.`id_presensi` DESC