app/Models/ModelAuth.php

    public function loginKaryawan($username, $password)
    {
        return $this->db->table('tbl_karyawan')->where([
            'username' => $username,
            'password' => $password,
        ])->get()->getRowArray();
---
SELECT *
FROM `tbl_karyawan`
WHERE `username` = 'budi'
AND `password` = '40bd001563085fc35165329ea1ff5c5ecbdbbeef'

    public function loginUser($username, $password)
    {
        return $this->db->table('tbl_user')->where([
            'username' => $username,
            'password' => $password,
        ])->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `username` = 'admin'
AND `password` = '40bd001563085fc35165329ea1ff5c5ecbdbbeef'